app/Controllers/Admin/PartnerAdminController.php

SELECT *
FROM `tbl_partners`
WHERE `tbl_partners`.`partner_id` = '1'
---
        $date = strip_tags(htmlspecialchars($this->request->getPost('date'), ENT_QUOTES));
        $category = strip_tags(htmlspecialchars($this->request->getPost('category'), ENT_QUOTES));
        // Cek Foto
        $partner = $this->partnerModel->find($partner_id);

UPDATE `tbl_partners` SET `partner_name` = 'BAZNAS', `partner_link` = 'https://google.com/mui', `partner_desc` = 'Kerjasama lintas instansi untuk produk halal', `partner_date` = '2025-03-10', `category_id` = '1', `partner_image` = '1741769333_9336dcca811f9ae458dc.png', `updated_at` = '2025-03-13 04:55:30'
WHERE `tbl_partners`.`partner_id` IN ('1')
---
            $fileFoto->move('assets/backend/images/partners/', $namaFotoUpload);
        }
        // Simpan ke database
        $this->partnerModel->update($partner_id, [
            'partner_name' => $nama,
            'partner_link' => $link,
            'partner_desc' => $desc,
            'partner_date' => $date,
            'category_id' => $category,
            'partner_image' => $namaFotoUpload
        ]);