app/Controllers/Admin/SettingAdminController.php

SELECT *
FROM `tbl_inbox`
WHERE `inbox_status` = 0
SELECT *
FROM `tbl_comment`
WHERE `comment_status` = 0
SELECT *
FROM `tbl_home`
 LIMIT 1
---
    public function home()
    {
        $data = [
            'site' => $this->siteModel->find(1),
            'akun' => $this->akun,
            'title' => 'Home Setting',
            'active' => $this->active,
            'total_inbox' => $this->inboxModel->where('inbox_status', 0)->get()->getNumRows(),
            'inboxs' => $this->inboxModel->where('inbox_status', 0)->findAll(),
            'total_comment' => $this->commentModel->where('comment_status', 0)->get()->getNumRows(),
            'comments' => $this->commentModel->where('comment_status', 0)->findAll(),
            'helper_text' => helper('text'),
            'breadcrumbs' => $this->request->getUri()->getSegments(),

            'homes' => $this->homeModel->first()