app/Controllers/Admin/TeamAdminController.php

SELECT *
FROM `tbl_inbox`
WHERE `inbox_status` = 0
SELECT *
FROM `tbl_comment`
WHERE `comment_status` = 0
SELECT *
FROM `tbl_team`
---
    public function index()
    {
        $data = [
            'site' => $this->siteModel->find(1),
            'akun' => $this->akun,
            'title' => 'All Team',
            'active' => $this->active,
            'total_inbox' => $this->inboxModel->where('inbox_status', 0)->get()->getNumRows(),
            'inboxs' => $this->inboxModel->where('inbox_status', 0)->findAll(),
            'total_comment' => $this->commentModel->where('comment_status', 0)->get()->getNumRows(),
            'comments' => $this->commentModel->where('comment_status', 0)->findAll(),
            'helper_text' => helper('text'),
            'breadcrumbs' => $this->request->getUri()->getSegments(),

            'teams' => $this->teamModel->findAll()

SELECT *
FROM `tbl_team`
WHERE `tbl_team`.`team_id` = '1'
---
        $instagram = strip_tags(htmlspecialchars($this->request->getPost('instagram'), ENT_QUOTES));
        $linked = strip_tags(htmlspecialchars($this->request->getPost('linked'), ENT_QUOTES));
        // Cek Foto
        $team = $this->teamModel->find($team_id);

UPDATE `tbl_team` SET `team_name` = 'Dr. H. A. Salamun AlBashri, M.Si', `team_org` = 'Majelis Tinggi', `team_twitter` = 'https://twitter.com/', `team_facebook` = 'https://facebook.com/', `team_instagram` = 'https://instagram.com/', `team_linked` = 'https://linkedin.com/', `team_image` = '1749457195_b83bc0dddb79eb01b0d0.jpg'
WHERE `tbl_team`.`team_id` IN ('1')
---
        }

        // Simpan ke database
        $this->teamModel->update($team_id, [
            'team_name' => $nama,
            'team_org' => $jabatan,
            'team_twitter' => $twitter,
            'team_facebook' => $facebook,
            'team_instagram' => $instagram,
            'team_linked' => $linked,
            'team_image' => $namaFotoUpload
        ]);