app/Controllers/CategoryController.php

    public function index($slug = null)
    {
        if ($slug == null) {
            return redirect()->to('/post');
        }
        $posts = $this->categoryModel->get_post_by_category($slug);
        if ($posts->getNumRows() < 1) {
            $posts = $posts->getResultArray();
            $keyword = "Category '$slug' tidak ditemukan";
        } else {
            $posts = $posts->getResultArray();
            $keyword = "$slug ";
        }
        $data = [
            'site' => $this->siteModel->find(1),
            'home' => $this->homeModel->find(1),
            'about' => $this->aboutModel->find(1),
            // 'posts' => $this->categoryModel->findAll(),
            'posts' => $this->categoryModel->get_post_by_category($slug),
            // 'pager' => $this->categoryModel->pager,
            'title' => 'Category',
            'keyword' => $keyword,
            'posts' => $posts,
            'active' => 'Post'
        ];
---
SELECT *
FROM `tbl_home`
WHERE `tbl_home`.`home_id` = 1
SELECT *
FROM `tbl_site`
WHERE `tbl_site`.`site_id` = 1
SELECT *
FROM `tbl_about`
WHERE `tbl_about`.`about_id` = 1