app/Controllers/CategoryDocsController.php

SELECT *
FROM `tbl_site`
WHERE `tbl_site`.`site_id` = 1
SELECT *
FROM `tbl_home`
WHERE `tbl_home`.`home_id` = 1
SELECT *
FROM `tbl_about`
WHERE `tbl_about`.`about_id` = 1
---
    public function index($slug = null)
    {
        if ($slug == null) {
            return redirect()->to('/dokumen');
        }
        $documents = $this->docscategoryModel->getDocs_by_category($slug);
        if ($documents->getNumRows() < 1) {
            $documents = $documents->getResultArray();
            $keyword = "Dokumen '$slug' tidak ditemukan";
        } else {
            $documents = $documents->getResultArray();
            $keyword = "Dokumen: $slug ";
        }
        $data = [
            'site' => $this->siteModel->find(1),
            'home' => $this->homeModel->find(1),
            'about' => $this->aboutModel->find(1),
            'documents' => $this->docscategoryModel->getDocs_by_category($slug),
            'title' => 'Dokumen',
            'url' => 'dokumen',
            'keyword' => $keyword,
            'documents' => $documents,
            'active' => 'Dokumen'
        ];