app/Controllers/CategoryPartController.php

SELECT *
FROM `tbl_site`
WHERE `tbl_site`.`site_id` = 1
SELECT *
FROM `tbl_home`
WHERE `tbl_home`.`home_id` = 1
SELECT *
FROM `tbl_about`
WHERE `tbl_about`.`about_id` = 1
---
    public function index($slug = null)
    {
        if ($slug == null) {
            return redirect()->to('/partner');
        }

        // Ambil data dari model
        $documents = $this->categoryModel->getPartner_by_category($slug);

        // Perbaiki pengecekan jumlah data menggunakan count()
        if (count($documents) < 1) {
            $keyword = "Partner '$slug' tidak ditemukan";
        } else {
            $keyword = "Partner: $slug ";
        }

        $data = [
            'site' => $this->siteModel->find(1),
            'home' => $this->homeModel->find(1),
            'about' => $this->aboutModel->find(1),
            'partners' => $documents, // Gunakan hasil query langsung
            'title' => 'Kerjasama',
            'url' => 'partner',
            'keyword' => $keyword,
            'documents' => $documents,
            'active' => 'Kerjasama'
        ];