app/Controllers/PrayerTimesController2.php

SELECT *
FROM `tbl_site`
WHERE `tbl_site`.`site_id` = 1
---
    public function index()
    {
        helper('url');

        // API untuk mendapatkan daftar kota
        $api_kota = 'https://api.myquran.com/v2/sholat/kota/semua';
        $kota_data = file_get_contents($api_kota);
        $list_kota = json_decode($kota_data)->data ?? [];

        // Ambil kota dari input GET, jika tidak ada gunakan default
        $kota_terpilih = $this->request->getGet('kota') ?? '1301';

        // API untuk mendapatkan jadwal sholat
        $tahun = $this->request->getGet('tahun') ?? date('Y');
        $bulan = $this->request->getGet('bulan') ?? date('n');
        $api_jadwal = 'https://api.myquran.com/v2/sholat/jadwal/' . $kota_terpilih . '/' . $tahun . '/' . $bulan;
        // $api_jadwal = 'https://api.myquran.com/v2/sholat/jadwal/' . $kota_terpilih . '/2025/3';
        $jadwal_data = file_get_contents($api_jadwal);
        $jadwal_sholat = json_decode($jadwal_data)->data->jadwal ?? [];

        // Kirim data ke view
        return view('pages/imsakiyah_view', [
            'site' => $this->siteModel->find(1),
            'title' => 'Kalender Jadwal Sholat',
            'list_kota' => $list_kota,
            'kota_terpilih' => $kota_terpilih,
            'jadwal_sholat' => $jadwal_sholat
        ]);