app/Controllers/ProgramsController.php

    public function index($slug = null)
    {
        if ($slug == null) {
            $data = [
                'site' => $this->siteModel->find(1),
                'home' => $this->homeModel->find(1),
                'about' => $this->aboutModel->find(1),
                'programs' => $this->programModel->getAllPrograms(),
                'pager' => $this->programModel->pager,
                'title' => 'Program-program',
                'active' => 'program'
            ];
            return view('pages/programs_view', $data);
        }

        // Ambil data program berdasarkan slug
        $program = $this->programModel->getProgramBySlug($slug);

        // Jika program tidak ditemukan, redirect ke halaman utama program
        if (!$program) {
            return redirect()->to('/program')->with('error', 'Program tidak ditemukan.');
        }

        $program_id = $program['program_id']; // Aman karena sudah dicek
        $category_id = $program['category_id'];

        $data = [
            'site' => $this->siteModel->find(1),
            'home' => $this->homeModel->find(1),
            'about' => $this->aboutModel->find(1),
            'program' => $program,
            'categories' => $this->categoryModel->getAllCategoriesWithPrograms(),
            'title' => $program['program_title'],
            'active' => 'program'
        ];
---
SELECT *
FROM `tbl_site`
WHERE `tbl_site`.`site_id` = 1
SELECT *
FROM `tbl_home`
WHERE `tbl_home`.`home_id` = 1
SELECT *
FROM `tbl_about`
WHERE `tbl_about`.`about_id` = 1