app/Controllers/ServicesController.php

SELECT *
FROM `tbl_site`
WHERE `tbl_site`.`site_id` = 1
SELECT *
FROM `tbl_home`
WHERE `tbl_home`.`home_id` = 1
SELECT *
FROM `tbl_about`
WHERE `tbl_about`.`about_id` = 1
---
    public function index($slug = null)
    {
        if ($slug == null) {
            $data = [
                'site' => $this->siteModel->find(1),
                'home' => $this->homeModel->find(1),
                'about' => $this->aboutModel->find(1),
                'services' => $this->serviceModel->getAllServices(),
                'pager' => $this->serviceModel->pager,
                'title' => 'Services',
                'active' => 'service'
            ];