app/Controllers/TagController.php

SELECT *
FROM `tbl_site`
WHERE `tbl_site`.`site_id` = 1
SELECT *
FROM `tbl_home`
WHERE `tbl_home`.`home_id` = 1
SELECT *
FROM `tbl_about`
WHERE `tbl_about`.`about_id` = 1
SELECT *
FROM `tbl_tags`
SELECT *
FROM `tbl_tags`
 LIMIT 2
SELECT COUNT(*) AS `numrows`
FROM `tbl_tags`
---
    public function index($slug = null)
    {
        if ($slug == null) {
            return redirect()->to('/post');
        }
        $posts = $this->tagModel->get_post_by_tags($slug);
        if ($posts->getNumRows() < 1) {
            $posts = $posts->getResultArray();
            $keyword = "'$slug' tidak ditemukan";
        } else {
            $posts = $posts->getResultArray();
            $keyword = "$slug ";
        }
        $data = [
            'site' => $this->siteModel->find(1),
            'home' => $this->homeModel->find(1),
            'about' => $this->aboutModel->find(1),
            'posts' => $this->tagModel->findAll(),
            // 'posts' => $this->tagModel->get_post_by_tags($tag),
            'posts' => $this->tagModel->paginate(2, 'posts'),
            'pager' => $this->tagModel->pager,
            'title' => 'Tag',
            'keyword' => $keyword,
            'posts' => $posts,
            'active' => 'Post'
        ];