app/Models/CategoryModel.php

    public function get_post_by_category($slug, $limit = 9)
    {
        return $this->select('tbl_post.*, tbl_category.category_name, tbl_category.category_slug, tbl_user.user_name, tbl_user.user_photo')
                    ->join('tbl_category', 'tbl_post.post_category_id = tbl_category.category_id', 'left')
                    ->join('tbl_user', 'tbl_post.post_user_id = tbl_user.user_id', 'left')
                    ->where('tbl_category.category_slug', $slug)
                    ->where('tbl_post.post_status', 1) // Hanya menampilkan post aktif
                    ->orderBy('tbl_post.post_date', 'DESC')
                    ->paginate($limit, 'posts'); // Sesuai dengan 'posts' di view
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_post`
LEFT JOIN `tbl_category` ON `tbl_post`.`post_category_id` = `tbl_category`.`category_id`
LEFT JOIN `tbl_user` ON `tbl_post`.`post_user_id` = `tbl_user`.`user_id`
WHERE `tbl_category`.`category_slug` = 'berita'
AND `tbl_post`.`post_status` = 1
SELECT `tbl_post`.*, `tbl_category`.`category_name`, `tbl_category`.`category_slug`, `tbl_user`.`user_name`, `tbl_user`.`user_photo`
FROM `tbl_post`
LEFT JOIN `tbl_category` ON `tbl_post`.`post_category_id` = `tbl_category`.`category_id`
LEFT JOIN `tbl_user` ON `tbl_post`.`post_user_id` = `tbl_user`.`user_id`
WHERE `tbl_category`.`category_slug` = 'berita'
AND `tbl_post`.`post_status` = 1
ORDER BY `tbl_post`.`post_date` DESC
 LIMIT 9