app/Models/MemberModel.php

SELECT *
FROM `tbl_member`
ORDER BY `created_at` DESC
---
    public function getAllMembers()
    {
        return $this->orderBy('created_at', 'DESC')->findAll();