app/Models/ProgramAdminModel.php

    public function getAllPrograms($onlyPublished = false)
    {
        $builder = $this->select('tbl_programs.*, tbl_program_categories.category_name')
                        ->join('tbl_program_categories', 'tbl_programs.category_id = tbl_program_categories.category_id', 'left')
                        ->orderBy('program_date', 'DESC');

        if ($onlyPublished) {
            $builder->where('program_status', 1);
        }

        return $builder->findAll();
---
SELECT `tbl_programs`.*, `tbl_program_categories`.`category_name`
FROM `tbl_programs`
LEFT JOIN `tbl_program_categories` ON `tbl_programs`.`category_id` = `tbl_program_categories`.`category_id`
ORDER BY `program_date` DESC