app/Models/ServiceAdminModel.php

SELECT *
FROM `tbl_services`
ORDER BY `created_at` DESC
---
    public function getAllServices()
    {
        return $this->orderBy('created_at', 'DESC')->findAll();